HELYXcore-4.4.0/examples/legacy/incompressible/overPimpleDyMFoam/cylinder/cylinderAndBackground/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

# Run it for a bit
runApplication $(getApplication)

#------------------------------------------------------------------------------
